src/mathematics/linear_algebra/KBe20math530flo22.org
#+AUTHOR: Exr0n
#+TITLE: Linear Algebra flo 22
* Linear independence of rows and columns
** there will always be the same number of linearly independent rows and columns in the matrix
* Functions vs Maps
  Technically, maps don't need to be well defined, meaning in a map one input might be allowed to go to multiple outputs. However, the linear maps that we are looking at will always be well defined.
  Maps give you a notion of "space" where as a function implies that the output depends on the input. Both are true, but each one gives a intuition for part of the picture.
* Proof by Contradiction                                            :careful:
  Make sure you actually have a contradiction! You might end up with an equation thats incorrect, but if it might be correct then it is not a valid proof by contradiction.
